AnypointStudio/workspace/integ-aribanet-invoice-status-outbound-adapter/target/classes/metadata/sample-jde-event.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:orac="http://oracle.e1.bssv.JP040000/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
			<wsse:UsernameToken>
				<wsse:Username>MULESOFTST</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">5AZB,XC3kG</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<orac:getVoucher>
			<!--Optional: -->
			<voucherGetHeader>
				<voucherKey>
					<!--Optional: -->
					<documentCompany>00210</documentCompany>
					<!--Optional: -->
					<documentNumber>196150</documentNumber>
					<!--Optional: -->
					<documentTypeCode>PV</documentTypeCode>
				</voucherKey>
			</voucherGetHeader>
		</orac:getVoucher>
	</soapenv:Body>
</soapenv:Envelope>


